In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import re

In [2]:
%matplotlib inline

In [3]:
summary = pd.read_csv("atusdata/atussum_2013.dat")
summary.info()

summary.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11385 entries, 0 to 11384
Columns: 413 entries, tucaseid to t500107
dtypes: float64(1), int64(412)
memory usage: 36.0 MB

,tucaseid,TUFINLWGT,TRYHHCHILD,TEAGE,TESEX,PEEDUCA,PTDTRACE,PEHSPNON,GTMETSTA,TELFS,...,t181501,t181599,t181601,t181801,t189999,t500101,t500103,t500105,t500106,t500107
0,20130101130004,11899905.662034,12,22,2,40,8,2,1,5,...,0,0,0,0,0,0,0,0,0,0
1,20130101130112,4447638.009513,1,39,1,43,1,2,1,1,...,0,0,0,0,0,0,0,0,0,0
2,20130101130123,10377056.507734,-1,47,2,40,1,2,1,4,...,25,0,0,0,0,0,0,0,0,0
3,20130101130611,7731257.992805,-1,50,2,40,1,1,1,1,...,0,0,0,0,0,0,0,0,0,0
4,20130101130616,4725269.227067,-1,45,2,40,2,2,1,1,...,0,0,0,0,0,0,0,0,0,0

In [4]:
summary[["TUFINLWGT","TESEX"]].head()

         TUFINLWGT  TESEX
0  11899905.662034      2
1   4447638.009513      1
2  10377056.507734      2
3   7731257.992805      2
4   4725269.227067      2

In [5]:
summary.TUDIARYDAY.describe()

count    11385.000000
mean         3.929029
std          2.342859
min          1.000000
25%          1.000000
50%          4.000000
75%          6.000000
max          7.000000
Name: TUDIARYDAY, dtype: float64

In [6]:
resp = pd.read_csv("atusdata/atusresp_2013.dat")
resp.head()

,TUCASEID,TULINENO,TUYEAR,TUMONTH,TEABSRSN,TEERN,TEERNH1O,TEERNH2,TEERNHRO,TEERNHRY,...,TXSPEMPNOT,TXSPUHRS,TXTCC,TXTCCTOT,TXTCOC,TXTHH,TXTNOHH,TXTO,TXTOHH,TXTONHH
0,20130101130004,1,2013,1,-1,-1,-1,-1,-1,-1,...,-1,-1,0,0,0,0,0,-1,-1,-1
1,20130101130112,1,2013,1,-1,-1,-1,-1,-1,2,...,0,0,0,0,0,0,-1,0,0,-1
2,20130101130123,1,2013,1,-1,-1,-1,-1,-1,-1,...,0,0,-1,0,0,-1,-1,-1,-1,-1
3,20130101130611,1,2013,1,-1,-1,-1,-1,-1,2,...,-1,-1,-1,0,0,-1,-1,-1,-1,-1
4,20130101130616,1,2013,1,-1,-1,-1,-1,-1,2,...,-1,-1,-1,0,0,-1,-1,-1,-1,-1

In [7]:
resp.TRTALONE.describe()

count    11385.000000
mean       316.122178
std        269.888458
min          0.000000
25%         95.000000
50%        240.000000
75%        483.000000
max       1440.000000
Name: TRTALONE, dtype: float64

In [8]:
rost = pd.read_csv("atusdata/atusrost_2013.dat")
who = pd.read_csv("atusdata/atuswho_2013.dat")
rostec = pd.read_csv("atusdata/atusrostec_2013.dat")
cps = pd.read_csv("atusdata/atuscps_2013.dat")
act = pd.read_csv("atusdata/atusact_2013.dat")

In [22]:
summary = summary.rename(columns={"t010101": "SLEEPING", 'tucaseid': 'ID', 
                                  'TEAGE': 'AGE', 't080601': 'BUYING_REALESTATE',
                                 "t110101": "EATING_DRINKING", 't130116': 'HIKING',
                                'TESEX': "GENDER"
                                 })

# START

In [23]:
my_frame = summary[["ID", "AGE", "GENDER", "SLEEPING", 'EATING_DRINKING', 'HIKING']]
my_frame.head()

               ID  AGE  GENDER  SLEEPING  EATING_DRINKING  HIKING
0  20130101130004   22       2       540               35       0
1  20130101130112   39       1       580               75       0
2  20130101130123   47       2       450              170       0
3  20130101130611   50       2       450               70       0
4  20130101130616   45       2       570              120       0

In [24]:
my_frame.describe()

,ID,AGE,GENDER,SLEEPING,EATING_DRINKING,HIKING
count,1.138500e+04,11385.000000,11385.000000,11385.000000,11385.000000,11385.000000
mean,2.013064e+13,48.279842,1.553623,527.265261,67.398595,0.247519
std,3.517213e+08,17.909707,0.497138,135.819112,50.883986,6.945454
min,2.013010e+13,15.000000,1.000000,0.000000,0.000000,0.000000
25%,2.013030e+13,34.000000,1.000000,450.000000,30.000000,0.000000
50%,2.013061e+13,48.000000,2.000000,520.000000,60.000000,0.000000
75%,2.013091e+13,62.000000,2.000000,600.000000,90.000000,0.000000
max,2.013121e+13,85.000000,2.000000,1413.000000,600.000000,340.000000

In [15]:
hikers = (my_frame.HIKING > 1)

In [39]:
hike_frame = my_frame[hikers]

hike_frame.replace({'GENDER': {1: 'Male', 2: 'Female'}})

                   ID  AGE  GENDER  SLEEPING  EATING_DRINKING  HIKING
1808   20130201132513   39    Male       300              180     180
2542   20130302131434   22  Female       630               90     340
3029   20130303132062   41    Male       480              105      20
3225   20130402132484   58    Male       540               60     120
3681   20130403131699   50    Male       365              226     180
3697   20130403131748   29    Male       520               60     180
4030   20130404130832   62  Female       390              150     300
5263   20130605130806   39  Female       450               70      60
6471   20130706131688   51  Female       600              230      40
6753   20130707130603   43    Male       490               48     250
7063   20130806132307   27  Female       630               60     180
7384   20130807131445   77  Female       615              125      45
7606   20130807132198   85    Male       635               90      60
7993   20130908130625   31    Male       600                0     120
8010   20130908130667   66  Female       510               40      90
8443   20130908132066   19    Male       466               21     120
10011  20131110131662   60    Male        80               90     248
10584  20131211130065   50  Female       435               60     120
11220  20131211132475   47  Female       461               65      75
11293  20131212131124   35  Female       554               95      90